phungvanquy/DiplomMaster_STM32_master/Core/Inc/MFRC522.h
	address &= 0x7f;
	cs_clr(1)
	;
	spi_transfer(address);
	spi_transfer(data);
	cs_set(1)
	;
}

char readRegister(char address) {

	int value;
	address |= 0x80;
	cs_clr(1);
	spi_transfer(address);
	value = spi_transfer(0x00);
	cs_set(1);

	return value;
}

void writeData(char reg,///< The register to write to. One of the PCD_Register enums.
		int count,		///< The number of bytes to write to the register
		char *values	///< The values to write. Byte array.
		) {
	int index;
	cs_clr(1);
	spi_transfer(reg & 0x7E);// MSB == 0 is for writing. LSB is not used in address. Datasheet section 8.1.2.3.
	for (index = 0; index < count; index++) {
		spi_transfer(values[index]);
	}
	cs_set(1);
} // End PCD_WriteRegister()

void readData(char reg,	///< The register to read from. One of the PCD_Register enums.
		int count,		///< The number of bytes to read
		char *values,	///< Byte array to store the values in.
		char rxAlign///< Only bit positions rxAlign..7 in values[0] are updated.
		) {

	//Serial.print("Reading "); 	Serial.print(count); Serial.println(" bytes from register.");
	byte address = 0x80 | (reg & 0x7E);	// MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
	byte index = 0;							// Index in values array.
	int i;
	byte value;
	if (count == 0) {
		return;
	}
	cs_clr(1);
	count--;						// One read is performed outside of the loop
	spi_transfer(address);		// Tell MFRC522 which address we want to read
	while (index < count) {
		if (index == 0 && rxAlign) { // Only update bit positions rxAlign..7 in values[0]
			// Create bit mask for bit positions rxAlign..7
			byte mask = 0;
			for (i = rxAlign; i <= 7; i++) {
				mask |= (1 << i);
			}
			// Read value and tell that we want to read the same address again.
			value = spi_transfer(address);
			// Apply mask to both current value of values[0] and the new data in value.
			values[0] = (values[index] & ~mask) | (value & mask);
		} else { // Normal case
			values[index] = spi_transfer(address);// Read value and tell that we want to read the same address again.
		}
		index++;
	}
	values[index] = spi_transfer(0);// Read the final byte. Send 0 to stop reading.
	cs_set(1);

} // End PCD_ReadRegister()

void Write_MFRC522(uchar addr, uchar val) {

	cs_clr(1);
	spi_transfer(((addr << 1) & 0x7E));
	spi_transfer(val);
	cs_set(1);

}

uchar Read_MFRC522(uchar addr) {

	int value;
	cs_clr(1);
	spi_transfer((((addr << 1) & 0x7E) | 0x80));
	value = spi_transfer(0x00);
	cs_set(1);

	return value;
}

/*
 * Function Name: ResetMFRC522
 * Description: Reset RC522
 * Input: None
 * Return value: None
 */
void MFRC522_Reset(void) {
	Write_MFRC522(CommandReg, PCD_RESETPHASE);
}

/////////////////////////////////////////////////////////////
///  Digilog.mihanblog.com        ///////////////////////////
/// 					          ///////////////////////////
///	 MFRC522 RFID module          ///////////////////////////
///  DEVELOPED BY MiladShiri      ///////////////////////////
///	 Ordibehesht 1393             ///////////////////////////
///  ver 1.0 					  ///////////////////////////
/////////////////////////////////////////////////////////////

/*
 * Function Name:InitMFRC522
 * Description: Initialize RC522
 * Input: None
 * Return value: None
 */
void MFRC522_Init(void) {
	MFRC522_Reset();

	// Timer: TPrescaler*TreloadVal/6.78MHz = 24ms
	Write_MFRC522(TModeReg, 0x8D);     // Tauto=1; f(Timer) = 6.78MHz/TPreScaler
	Write_MFRC522(TPrescalerReg, 0x3E); // TModeReg[3..0] + TPrescalerReg
	Write_MFRC522(TReloadRegL, 30);
	Write_MFRC522(TReloadRegH, 0);
	Write_MFRC522(TxAutoReg, 0x40);     // force 100% ASK modulation
	Write_MFRC522(ModeReg, 0x3D);       // CRC Initial value 0x6363

	// interrupts, still playing with these
	// Write_MFRC522(CommIEnReg, 0xFF);
	// Write_MFRC522(DivlEnReg, 0xFF);

	// turn antenna on
	AntennaOn();
}

/*
 * Function Name:AntennaOn
 * Description: Open antennas, each time you start or shut down the natural barrier between the transmitter should be at least 1ms interval
 * Input: None
 * Return value: None
 */
void AntennaOn(void) {
	SetBitMask(TxControlReg, 0x03);
}

/*
 * Function Name:SetBitMask
 * Description: Set RC522 register bit
 * Input parameters: reg - register address; mask - set value
 * Return value: None
 */
void SetBitMask(uchar reg, uchar mask) {
	uchar tmp;
	tmp = Read_MFRC522(reg);
	Write_MFRC522(reg, tmp | mask);  // set bit mask
}

/*
 * Function Name:MFRC522_Request
 * Description: Find cards, read the card type number
 * Input parameters: reqMode - find cards way
 *   TagType - Return Card Type
 *    0x4400 = Mifare_UltraLight
 *    0x0400 = Mifare_One(S50)
 *    0x0200 = Mifare_One(S70)
 *    0x0800 = Mifare_Pro(X)
 *    0x4403 = Mifare_DESFire
 * Return value: the successful return MI_OK
 */
uchar MFRC522_Request(uchar reqMode, uchar *TagType) {
	uchar status;
	uint backBits; // The received data bits

	Write_MFRC522(BitFramingReg, 0x07);
	// TxLastBists = BitFramingReg[2..0]

	TagType[0] = reqMode;

	status = MFRC522_ToCard(PCD_TRANSCEIVE, TagType, 1, TagType, &backBits);
	if ((status != MI_OK) || (backBits != 0x10)) {
		status = MI_ERR;
	}

	return status;
}

/*
 * Function Name: MFRC522_ToCard
 * Description: RC522 and ISO14443 card communication
 * Input Parameters: command - MF522 command word,
 *			 sendData--RC522 sent to the card by the data
 *			 sendLen--Length of data sent	 
 *			 backData--Received the card returns data,
 *			 backLen--Return data bit length
 * Return value: the successful return MI_OK
 */
uchar MFRC522_ToCard(uchar command, uchar *sendData, uchar sendLen,
		uchar *backData, uint *backLen) {
	uchar status = MI_ERR;
	uchar irqEn = 0x00;
	uchar waitIRq = 0x00;
	uchar lastBits;
	uchar n;
	uint i;

	switch (command) {
	case PCD_AUTHENT:     // Certification cards close
	{
		irqEn = 0x12;
		waitIRq = 0x10;
		break;
	}
	case PCD_TRANSCEIVE:  // Transmit FIFO data
	{
		irqEn = 0x77;
		waitIRq = 0x30;
		break;
	}
	default:
		break;
	}

	Write_MFRC522(CommIEnReg, irqEn | 0x80);  // Interrupt request
	ClearBitMask(CommIrqReg, 0x80);         // Clear all interrupt request bit
	SetBitMask(FIFOLevelReg, 0x80);        // FlushBuffer=1, FIFO Initialization

	Write_MFRC522(CommandReg, PCD_IDLE); // NO action; Cancel the current command

	// Writing data to the FIFO
	for (i = 0; i < sendLen; i++) {
		Write_MFRC522(FIFODataReg, sendData[i]);
	}

	// Execute the command
	Write_MFRC522(CommandReg, command);
	if (command == PCD_TRANSCEIVE) {
		SetBitMask(BitFramingReg, 0x80); // StartSend=1,transmission of data starts  
	}

	// Waiting to receive data to complete
	i = 2000;// i according to the clock frequency adjustment, the operator M1 card maximum waiting time 25ms
	do {
		// CommIrqReg[7..0]
		// Set1 TxIRq RxIRq IdleIRq HiAlerIRq LoAlertIRq ErrIRq TimerIRq
		n = Read_MFRC522(CommIrqReg);
		i--;
	} while ((i != 0) && !(n & 0x01) && !(n & waitIRq));
	ClearBitMask(BitFramingReg, 0x80);      // StartSend=0
	if (i != 0) {
		if (!(Read_MFRC522(ErrorReg) & 0x1B)) // BufferOvfl Collerr CRCErr ProtecolErr
		{
			status = MI_OK;
			if (n & irqEn & 0x01) {
				status = MI_NOTAGERR;             // ??
			}

			if (command == PCD_TRANSCEIVE) {
				n = Read_MFRC522(FIFOLevelReg);
				lastBits = Read_MFRC522(ControlReg) & 0x07;
				if (lastBits) {
					*backLen = (n - 1) * 8 + lastBits;
				} else {
					*backLen = n * 8;
				}

				if (n == 0) {
					n = 1;
				}
				if (n > MAX_LEN) {
					n = MAX_LEN;
				}

				// Reading the received data in FIFO
				for (i = 0; i < n; i++) {
					backData[i] = Read_MFRC522(FIFODataReg);
				}
			}
		} else {
			//printf("~~~ buffer overflow, collerr, crcerr, or protecolerr\r\n");
			HAL_UART_Transmit(&huart2,
					(uchar*) "~~~ buffer overflow, collerr, crcerr, or protecolerr\r\n",
					54, 5000);
			status = MI_ERR;
		}
	} else {
		//printf("~~~ request timed out\r\n");
		HAL_UART_Transmit(&huart2, (uchar*) "~~~ request timed out\r\n", 23,
				5000);

