phungvanquy/DiplomMaster_STM32_master/Core/Inc/MFRC522.h
uchar keyA[6] = { 0xFf, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
uchar keyA_new[6] = { 0x11, 0x11, 0x11, 0x11, 0x11, 0x11};
uchar keyB[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
uchar keyB_new[6] = { 0x22, 0x22, 0x22, 0x22, 0x22, 0x22};
/*
 * Function Name: ScanCardAndreadAllData
 * Description: Scan MIFARE Card and Read All block of the Card
 * Input: None
 * Return value: None
 */
void ScanCardAndreadAllData(void) {
	uchar str[16];

	/*** 1. Start RFID Reader ***/
	MFRC522_Init();

	/*** 2. Make request and receive Card type ***/
	if (MFRC522_Request(PICC_REQIDL, str) == MI_OK) {
		HAL_UART_Transmit(&huart2, (uchar*) "\n\r**** Card detected! ****\n\r",
				(uint8_t)strlen("\n\r**** Card detected! ****\n\r"), 5000);
		HAL_UART_Transmit(&huart2, (uchar*) "Card Type: ", 14, 5000);
		uchar x[5];
		sprintf((char*)x, "%02x%02x", str[0], str[1]);
		HAL_UART_Transmit(&huart2, x, strlen((char*)x), 5000);
	}

	/*** 3. Anti-collision loop, get identifier of Card ***/
	if (MFRC522_Anticoll(str) == MI_OK) {
		HAL_UART_Transmit(&huart2, (uint8_t*) "\n\rThe card's number is: ", 25,
				5000);
		uchar temp_string[100];
		sprintf((char*) temp_string, "%02x %02x %02x %02x\r\n", str[0], str[1],
				str[2], str[3]);
		HAL_UART_Transmit(&huart2, (uint8_t*) temp_string, (uint16_t) strlen((char*)temp_string),
				5000);

		/*** 4. Select Card ***/
		MFRC522_SelectTag(str);

		/*** 5. Pass authentication on every sector ***/
		for (int i = 0; i < 64; i++) {
			// First, we try to use KeyA authentication (COMMAND CODE: 0x60 - KeyA, 0x61 - KeyB)
			if (MI_OK == MFRC522_Auth(0x60, i, keyA, str)) {
				uchar receivedData[16];
				if (MFRC522_Read(i, receivedData) == MI_OK) {
					// Print receivedData if READ is OK
					uchar temp_string[15];
					sprintf((char*) temp_string, "\n\rBlock %2d: ", i);
					HAL_UART_Transmit(&huart2, temp_string, 13, 5000);
					for (int j = 0; j < 16; j++) {
						uchar x[3];
						sprintf((char*) x, "%02x", receivedData[j]);
						HAL_UART_Transmit(&huart2, x, 2, 5000);
						HAL_UART_Transmit(&huart2, (uchar*) " ", 1, 5000);
					}
				} else {
					// Print error if READ is not OK
					HAL_UART_Transmit(&huart2,
							(uint8_t*) "Error: Can not read data",
							strlen("Error: Can not read data\n\r"), 5000);
				}
			}
			// Second, we try to use KeyB authentication
			else if (MI_OK == MFRC522_Auth(0x61, i, keyB, str)) {
				uchar receivedData[16];
				if (MFRC522_Read(i, receivedData) == MI_OK) {
					// Print receivedData if READ ok
					uchar temp_string[15];
					sprintf((char*) temp_string, "Block %2d:\n\r", i);
					HAL_UART_Transmit(&huart2, temp_string, 13, 5000);
					for (int j = 0; j < 16; j++) {
						uchar x[3];
						sprintf((char*)x, "%02x", receivedData[j]);
						HAL_UART_Transmit(&huart2, x, 2, 5000);
						HAL_UART_Transmit(&huart2, (uchar*) " ", 1, 5000);
					}
				} else {
					// Print error if READ is not ok
					HAL_UART_Transmit(&huart2,
							(uint8_t*) "Error: Can not read data",
							strlen("Error: Can not read data\n\r"), 5000);
				}
			}
			// If KeyA and KeyB authentications don't work, they must be a wrong key
			else {
				HAL_UART_Transmit(&huart2, (uchar*) "\n\rKeys are wrong.\n\r",
						19, 5000);
			}
		}
	}

	/*** 6. HALT ***/
	MFRC522_Halt();

}


/*
 * Function Name: ScanCardAndGetDataFromBlock
 * Description: Scan MIFARE Card and Read 1 block of the Card
 * Input:
 * 		blockAddr: block number desired to Read
 * 		receivedData: pointer to Data Returned after reading
 * 		keyValue: Value of KEY_A or KEY_B
 * Return value: MI_OK or MI_ERR
 */
uint8_t ScanCardAndGetDataFromBlock(uint8_t blockAddr, uchar* receivedData, uchar* keyValue) {
	uchar str[16];

	/*** 1. Start RFID Reader ***/
	MFRC522_Init();

	/*** 2. Make request and receive Card type ***/
	if (MFRC522_Request(PICC_REQIDL, str) != MI_OK) {
		return MI_ERR;
	}

	/*** 3. Anti-collision loop***/
	if (MFRC522_Anticoll(str) == MI_OK) {

	/*** 4. Select Card ***/
		MFRC522_SelectTag(str);

	/*** 5. Pass authentication on every sector ***/
		// First, we try to use KeyA authentication (COMMAND CODE: 0x60 - KeyA, 0x61 - KeyB)
		if (MI_OK == MFRC522_Auth(0x60, blockAddr, keyValue, str)) {
				//Read Data
			if (MFRC522_Read(blockAddr, receivedData) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if READ is not OK
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not read data",
						strlen("Error: Can not read data\n\r"), 5000);
			}
		}
		// Second, we try to use KeyB authentication
		else if (MI_OK == MFRC522_Auth(0x61, blockAddr, keyValue, str)) {
				// Read Data
			if (MFRC522_Read(blockAddr, receivedData) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if READ is not ok
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not read data",
						strlen("Error: Can not read data\n\r"), 5000);
			}
		}
		// If KeyA and KeyB authentications don't work, they must be a wrong key
		else {
			HAL_UART_Transmit(&huart2, (uchar*) "\n\rKeys are wrong.\n\r", 19,
					5000);
		}
	}

	/*** 6. HALT ***/
	MFRC522_Halt();

	return MI_ERR;
}


/*
 * Function Name: ScanCardAndLoadDataToBlock
 * Description: Scan MIFARE Card and Load Data to 1 block of the Card
 * Input:
 * 		blockAddr: block number desired to Read
 * 		dataToLoad: pointer to Data to Load
 * 		keyValue: Value of KEY_A or KEY_B
 * Return value: MI_OK or MI_ERR
 */
uint8_t ScanCardAndLoadDataToBlock(uint8_t blockAddr, uchar* dataToLoad, uchar* keyValue) {

	uchar str[16];

	/*** 1. Start RFID Reader ***/
	MFRC522_Init();

	/*** 2. Make request and receive Card type ***/
	if (MFRC522_Request(PICC_REQIDL, str) != MI_OK) {
		return MI_ERR;
	}

	/*** 3. Anti-collision loop***/
	if (MFRC522_Anticoll(str) == MI_OK) {


	/*** 4. Select Card ***/
		MFRC522_SelectTag(str);

	/*** 5. Pass authentication on every sector ***/
		// First, we try to use KeyA authentication (COMMAND CODE: 0x60 - KeyA, 0x61 - KeyB)
		if (MI_OK == MFRC522_Auth(0x60, blockAddr, keyValue, str)) {
				//If its a trailer block, it would be limit to be loaded
			if((blockAddr + 1) % 4 == 0 || blockAddr == 0 ){
				HAL_UART_Transmit(&huart2, (uint8_t*)"Data could not be Loaded in this block!\n\r", strlen("Data could not be Loaded in this block!\n\r"), HAL_MAX_DELAY);
				return MI_ERR;
			}
				//Load Data
			if (MFRC522_Write(blockAddr, dataToLoad) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if WRITE is not OK
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not WRITE data",
						strlen("Error: Can not WRITE data\n\r"), 5000);
			}
		}
		// Second, we try to use KeyB authentication
		else if (MI_OK == MFRC522_Auth(0x61, blockAddr, keyValue, str)) {
				// Load Data
			if (MFRC522_Write(blockAddr, dataToLoad) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if WRITE is not ok
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not WRITE data",
						strlen("Error: Can not WRITE data\n\r"), 5000);
			}
		}
		// If KeyA and KeyB authentications don't work, they must be a wrong key
		else {
			HAL_UART_Transmit(&huart2, (uchar*) "\n\rKeys are wrong.\n\r", 19,
					5000);
		}
	}

	/*** 6. HALT ***/
	MFRC522_Halt();

	return MI_ERR;
}

