phungvanquy/DiplomMaster_STM32_master/Core/Inc/MFRC522.h
/*
 * Function Name: ScanCardAndLoadKeyToSector
 * Description: Scan MIFARE Card and Load Data to 1 block of the Card
 * Input:
 * 		sectorAddr: address of Sector [0..15]
 * 		keyType: type of key [KEY_TYPE_A, KEY_TYPE_B]
 * 		tempKeyValue: temporary key value of KEY_A or KEY_B
 * 		newKeyValue: new value of the key to load
 * Return value: MI_OK or MI_ERR
 */
uint8_t ScanCardAndLoadKeyToSector(uint8_t sectorAddr, uint8_t keyType, uchar* tempKeyValue, uchar* newKeyValue) {
	uchar str[16];
	uchar dataToLoad[16] = {0xff, 0xff, 0xff, 0xff,0xff, 0xff, 0xff, 0x07, 0x80, 0x69, 0xff, 0xff, 0xff, 0xff,0xff, 0xff};

	if( keyType == KEY_TYPE_A){
		for (int i = 0; i < 6; i++){
			dataToLoad[i] = newKeyValue[i];
		}
	}
	else if (keyType == KEY_TYPE_B){
		for (int i = 0; i < 6; i++){
			dataToLoad[i+10] = newKeyValue[i];
		}
	}

	/*** 1. Start RFID Reader ***/
	MFRC522_Init();

	/*** 2. Make request and receive Card type ***/
	if (MFRC522_Request(PICC_REQIDL, str) != MI_OK) {
		return MI_ERR;
	}

	/*** 3. Anti-collision loop***/
	if (MFRC522_Anticoll(str) == MI_OK) {


	/*** 4. Select Card ***/
		MFRC522_SelectTag(str);

	/*** 5. Pass authentication on every sector ***/
		// First, we try to use KeyA authentication (COMMAND CODE: 0x60 - KeyA, 0x61 - KeyB)
		uint8_t blockAddr = sectorAddr*4 + 3;
		if (MI_OK == MFRC522_Auth(0x60, blockAddr, tempKeyValue, str)) {
				//Load Data
			if (MFRC522_Write(blockAddr, dataToLoad) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if WRITE is not OK
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not WRITE data",
						strlen("Error: Can not WRITE data\n\r"), 5000);
			}
		}
		// Second, we try to use KeyB authentication
		else if (MI_OK == MFRC522_Auth(0x61, blockAddr, tempKeyValue, str)) {
				// Load Data
			if (MFRC522_Write(blockAddr, dataToLoad) == MI_OK) {
				return MI_OK;
			} else {
				// Print error if WRITE is not ok
				HAL_UART_Transmit(&huart2,
						(uint8_t*) "Error: Can not WRITE data",
						strlen("Error: Can not WRITE data\n\r"), 5000);
			}
		}
		// If KeyA and KeyB authentications don't work, they must be a wrong key
		else {
			HAL_UART_Transmit(&huart2, (uchar*) "\n\rKeys are wrong.\n\r", 19,
					5000);
		}
	}

	/*** 6. HALT ***/
	MFRC522_Halt();

	return MI_ERR;
}


#endif

